[{"user":"LegoManiac04","uid":21629747,"date":"August 10, 2023","title":"See y'all around!     &#128075;","post":"&lt;h2&gt;Hiya frens! &lt;/h2&gt;With the summer coming to an end, so has my activity on Scratch. With this, there are a couple things I&apos;d like to say, as I am heading away for a while again.&lt;br&gt;&lt;br&gt;&lt;b&gt;For one, taking care of the Hivezine:&lt;/b&gt;&lt;br&gt; I&apos;d like to remind you all that Writers, and Managers, have the ability to remove (and add) Writers and their posts on the Hivezine.  Of course, all posts are posted on Scratch, so they have to pass through Scratch&apos;s filter, however, if there is a post that you, as a Writer or Manager, feel breaks Scratch or Gaehive Guidelines, please delete the post by clicking the title of the post, and clicking the small delete button in the top right. If it breaks Community Guidelines, make sure you report the comment, which you can find in &lt;a href=&quot;https://scratch.mit.edu/studios/33586934/comments&quot;&gt;this studio&lt;/a&gt;.  If you&apos;re neither a Writer or a Manager, I&apos;d encourage you to reach out to one if you feel a post does not belong here.&lt;br&gt;&lt;br&gt;I also leave it up to you Writers, and especially Managers, whether a Writer is no longer fit for the position. If you feel a Writer should be removed, please do so by clicking the &quot;Edit Writers&quot; button on the Hivezine homepage. Once their login expires two weeks after their most recent login, they will lose Hivezine access.&lt;br&gt; If there are any users who you think would make a great Writer, you can also add them!&lt;br&gt;&lt;br&gt;&lt;b&gt;The Home page:&lt;/b&gt;&lt;br&gt;Writers and Managers can pin posts to the homepage by clicking on the post and clicking the small pin button in the top right. Please only pin posts if they are important studio news or announcements!&lt;br&gt;&lt;br&gt;&lt;b&gt;The Manager page:&lt;/b&gt;&lt;br&gt;The managers page is pretty straightforward;  If we promote new managers, or a current one leaves/becomes inactive, you Managers can add and remove them by clicking the &quot;Edit Managers&quot; button.&lt;br&gt;&lt;br&gt;&lt;b&gt;Overall:&lt;/b&gt;&lt;br&gt;Please leave any feedback, questions, ideas, or bug reports by clicking the &quot;feedback&quot; button on the sidebar. I&apos;ll check there every so often.","id":106,"like":9,"likeby":["Amazing_Enby","ARCHlVED","memorysauce","Soaring-Jay","lesbiandragons","Moonwatcher127","-Lotus-Eater-","dancinqq-","iliveonthisplanet"],"sad":2,"sadby":["lesbiandragons","Soaring-Jay"],"laugh":1,"laughby":["memorysauce"],"love":2,"loveby":["lesbian-lucifer","memorysauce"]}]