[{"user":"-Lotus-Eater-","uid":117133059,"date":"August 13, 2023","title":"Witherbloom Academy (bi-weekly narrative poetry with Ink) ep: 2\n","post":"&lt;center&gt;&lt;b&gt;Small shards of life&lt;/b&gt;&lt;/center&gt;&lt;br&gt; &lt;br&gt; Little pockets of happy &lt;br&gt;Floral king of life &lt;br&gt; No matter what they say to us &lt;br&gt; We know our lives are rife &lt;br&gt; With lust and colour &lt;br&gt; The moment we&apos;ve glee, they&rsquo;re in a dither. &lt;br&gt; &lt;br&gt; Give us a chance &lt;br&gt; To have love and romance &lt;br&gt; Yes, we are young &lt;br&gt; But our lungs breathe the air that you breathe &lt;br&gt; Our hearts feel the things that you feel. &lt;br&gt; We may be immature but &lt;br&gt; A rose by any other name would smell as sweet &lt;br&gt; Isn&apos;t love entitled to such? &lt;br&gt; &lt;br&gt; So I pick flowers. &lt;br&gt; While the hours &lt;br&gt; Away &lt;br&gt; Day to day &lt;br&gt; Take me away &lt;br&gt; To a place &lt;br&gt; Where I can build a bouquet &lt;br&gt; for the one l love. &lt;br&gt; &lt;br&gt; Let me exchange my turtle doves. &lt;br&gt; &lt;br&gt; -William &lt;br&gt;&lt;br&gt;&lt;br&gt; ~~~~~~~~~~~~~~~~~~~~~~~~~&lt;br&gt;&lt;br&gt; &lt;b&gt;&lt;u&gt;(AU):&lt;/u&gt;&lt;i&gt; Thank you for reading this post, i really appreciate it, new entries will continue to come Sundays and Wednesdays. If you missed my last one, you can always check out my scratch studio with a full library of all past entries { https://scratch.mit.edu/studios/33694307/ } or you can just check out the scratch project for this entry, which has footnotes and explanations for this entry, as well as its relations to past and future episodes { https://scratch.mit.edu/projects/882279350/ }. And as always, thank you for your time. :pride::heart::trans:","pid":231465418,"id":128,"love":5,"loveby":["CreateFrog","ICantCallNow","dancinqq-","ARCHlVED","-Lotus-Eater-"],"like":2,"likeby":["ICantCallNow","-Lotus-Eater-"],"sad":1,"sadby":["lesbiandragons"]}]