[{"user":"melody-sy","uid":108189592,"date":"August 7, 2023","title":"Mellie&apos;s Writing Corner 1 - Drifting (Part 2)","post":"&lt;p&gt;I missed. I&apos;m probably not cool enough to do something like that anyway. But with quick thinking, I continue the swing and spin around, hitting the mushroom away after it had landed on the ground. Oh yeah, that&apos;s improv for you! I knew practicing cool over-the-top fighting moves in my room when nobody was home was going to come in handy someday.&lt;/p&gt;\n&lt;p&gt;At this point the mushroom creature is knocked out, I&apos;m sitting on the ground with my leg still in pain, and the clouds of sparkly dust we both kicked up are beginning to settle.&lt;/p&gt;\n&lt;p&gt;Wait! No, the mushroom monster is slowly getting back up! My adrenaline rush had already worn off, and I can&apos;t get on my feet for another round because of whatever burning juice that thing had on its teeth. It&apos;s now slowly trudging towards me, barely holding on but ready for one last attack to finish me off. And I think I&apos;m ready to accept my fate...&lt;/p&gt;&lt;p&gt;&quot;Hey! Leave &apos;em alone, you rotten pizza topping!&quot;&lt;/p&gt;\n&lt;p&gt;That voice, it sounds small and soft, and scratchy in a charming way. But as soon as I heard it, I had only one thought: people! I was starting to think this whole place was just crawling with killer beasts and creatures.&lt;/p&gt;\n&lt;p&gt;The mushroom froze in its tracks as well, like a criminal caught red-handed. It darted away without even a single slurp.&lt;/p&gt;&lt;p&gt;The source of the voice walks in through the trees. I look at them for a moment. they&apos;re certainly not any type of anthropomorphic animal I recognize. They&apos;re short, with fuzzy fur split right down the middle in a half-white-half-black pattern, big ears, one big curly lock of hair, and no arms or wings or any sort of upper limbs in sight.&lt;/p&gt;\n&lt;p&gt;&quot;Stars, what a weirdo.&quot;&lt;/p&gt;\n&lt;p&gt;I continue staring. Look, you may not know this about me, but I&apos;ve never been a really social person--talking to new people is hard. I don&apos;t really like my voice, anyway. But I&apos;m getting ahead of myself.&lt;/p&gt;&lt;p&gt;&quot;Oh, not you. I mean the other guy.&quot; They gesture towards the direction the mushroom  monster ran off in. I awkwardly nod in understanding...&lt;/p&gt;\n&lt;p&gt;They walk closer and kneel down next to me, noticing that I&apos;ve been clutching my leg.&lt;/p&gt;\n&lt;p&gt;&quot;Are you alright? You&apos;re not hurt, are you?&quot; Their ears twitch a little bit. &quot;Here, let me have a look.&quot;&lt;/p&gt;\n&lt;p&gt;Hesitantly, I move my wings off of my leg, still burning from the acidic venom. I sure hope this isn&apos;t some monster trying to lower my guard and attack me where I&apos;m already weakened...&lt;/p&gt;\n&lt;p&gt;&quot;Yikes, that does look bad... Here, watch this.&quot;&lt;/p&gt;\n&lt;p&gt;They pull out a sort of ribbon, and wrap it around my leg like a very frilly bandage. And now they&apos;re tying a bow over the wound using their hair like an arm, and... Huh?&lt;/p&gt;\n&lt;p&gt;As soon as the bow is tied, the ribbon begins to glow and dissolve, crumbling into the same glimmering dust that&apos;s all over the ground. And sure enough, when the ribbon is gone, my leg&apos;s completely healed! I have to say, I&apos;m confused, but also kind of impressed at the same time.&lt;/p&gt;&lt;p&gt;The fuzzy  creature kind of leans on my shoulder in a smug &quot;Cool, huh?&quot; sort of way.&lt;/p&gt;\n&lt;p&gt;&quot;Usually I&apos;d charge you for that, but I&apos;m sure my wallet wouldn&apos;t mind if I skipped that just this once.&quot; I can almost hear the playful snark in their voice... Seemingly brimming with energy, they dart over to a spot next to me and sit down.&lt;/p&gt;&lt;p&gt;&quot;Anyway, my name&apos;s Zee!&quot; They pause, and switch back to the snarky voice. &quot;But you can call me Zed if you prefer.&quot;&lt;/p&gt;\n&lt;p&gt;I&apos;m not sure how to progress the conversation at this point. Talking isn&apos;t my strong suit. But I do manage to let out a shaky and quiet...&lt;/p&gt;\n&lt;p&gt;&quot;Hi.&quot;&lt;/p&gt;\n&lt;p&gt;Euegh, that came too blunt, too deep, too emotionless, I sound like a narrator for a serious documentary or something. Bad first impression! I pull my scarf over my mouth in shame, but Zee doesn&apos;t seem to notice.&lt;/p&gt;\n&lt;p&gt;&quot;So what brings you to this quiet little corner of the Rift? Seeing other not-monsters is rare in this part of the Crystal Forest, you know.&quot;&lt;/p&gt;&lt;p&gt;Rift? Crystal Forest? You can&apos;t just throw these words at me and expect me to understand, I just got here and I am lost and confused!&lt;/p&gt;\n&lt;p&gt;I really don&apos;t want to talk again, though. I end up tilting my head at Zee like a confused dog.&lt;/p&gt;\n&lt;p&gt;&quot;Ah, you&apos;re... out of the loop.&quot; Zee seems lost in thought now... &quot;Ahh... ahhhh... Aha!&quot;&lt;/p&gt;\n&lt;p&gt;Zee seems to have come to... Some sort of realization?&lt;/p&gt;&lt;p&gt;&quot;You&apos;re a Drifter, aren&apos;t you?&quot;&lt;/p&gt;\n&lt;p&gt;Drifter... I&apos;m not entirely sure what that means, but...&lt;/p&gt;\n&lt;p&gt;&quot;I, well, I forgot how to explain it. But basically a Drifter is someone from outside the Rift, who is now in the Rift.&quot; Zee stumbles a bit, realizing too late they forgot an important detail... &quot;Um! The Rift is what we call this world, by the way.&quot;&lt;/p&gt;\n&lt;p&gt;This is all so confusing... But at least I have some context, I guess?&lt;/p&gt;&lt;p&gt;&quot;I&apos;m sorry, this must be a lot of trouble for you.&quot; Zee sighs and stands up. I shakily do the same. &quot;Tell you what, how about we get you somewhere safe, and then we can sort this out?&quot;&lt;/p&gt;\n&lt;p&gt;Zee gestures towards the other side of the clearing. &quot;There&apos;s a little town up ahead called Rift&apos;s Edge. I run the healing inn there, you know... Maybe It&apos;d be a good place to rest up?&quot;&lt;/p&gt;&lt;p&gt;I brush the dust off of my knees. Zee seems eager to continue and is already moving forward, looking at me as if they expect me to follow.&lt;/p&gt;&lt;p&gt;&quot;Either way, it&apos;s best we get going, before another monster comes out and kills both of us, or something! Come on!&quot;&lt;/p&gt; &lt;p&gt;Why do I feel as if I&apos;m not going home anytime soon?&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;span style=&quot;color: #ff99cc;&quot;&gt;that&apos;s all for now! if you liked it you are welcome to tell me on my scratch profile :3&lt;/span&gt;&lt;/p&gt;","id":43,"love":8,"loveby":["NebulaOfTheEarth","ARCHlVED","-arofluixity-","memorysauce","livid---liam","Moonwatcher127","LegoManiac04","PrincessMeta"],"like":3,"likeby":["purple_cat_human_","--b-a-s-i-l--","memorysauce"],"laugh":1,"laughby":["memorysauce"],"yay":1,"yayby":["memorysauce"],"wow":1,"wowby":["memorysauce"],"sad":1,"sadby":["lesbiandragons"]}]