[{"user":"melody-sy","uid":108189592,"date":"August 7, 2023","title":"Mellie&apos;s Writing Corner 1 - Drifting (Part 1)","post":"&lt;p&gt;&lt;span style=&quot;color: #ff99cc;&quot;&gt;mellie notes: this is an adaptation of the introduction to my game, zephyr star :3 this is mostly here to give you context to the world, in the future i plan to expand on it writing about aspects and characters that aren&apos;t explored in the game... but for now, here&apos;s this&lt;/span&gt;&lt;/p&gt; &lt;p style=&quot;text-align: center;&quot;&gt;July 17, 1998&lt;/p&gt; &lt;p&gt;Let me get my bearings straight: I was getting ready to leave for baseball practice--I stretched my wings, I put on my jacket and my hand-me-down pink scarf, I grabbed my trusty old baseball bat... But as soon as I walked through my bedroom door, I think I blacked out?&lt;/p&gt; &lt;p&gt;Maybe I was just very tired and fell asleep on the spot, and now I&apos;m dreaming? I don&apos;t think I felt tired, and this feels too clear to be a dream. Maybe there was some sort of freak accident, and I died before I could even process it? Is this the afterlife? No, no, that&apos;s just absurd. But what I do know is that this certainly not where I just was.&lt;/p&gt; &lt;p&gt;I think I saw an anime sort of like this once at the video rental place the other day, but that&apos;s besides the point.&lt;/p&gt;\n&lt;p&gt;The ground here is... powdery? It&apos;s not snow, and I don&apos;t think it&apos;s sand or dirt either. It&apos;s cold, but it&apos;s not freezing, and it&apos;s a very sparkly white. It feels nice to sift through my batty wing membrane, too. And the trees, where to start with the trees... They&apos;re like pine trees, but their needles are bright red, and they have a subtle glow to them. Certainly from the floating glowing jellyfish hovering about the place. Did I mention the jellyfish? They&apos;re almost mesmerizing to look at...&lt;/p&gt;\n&lt;p&gt;I&apos;m so confused as to where I am and what&apos;s going on, but I can&apos;t help but appreciate the peaceful energy this place has.&lt;/p&gt;&lt;p&gt;No, no, no... Beautiful as it is, I can&apos;t stick around. I think first and foremost, I need to find a way home. Somehow. I&apos;m not sure where to start, though... I suppose I have no choice but to wander around and see if I can get anywhere.&lt;/p&gt;\n&lt;p&gt;* * *&lt;/p&gt;\n&lt;p&gt;After a bit of walking, I found something. It&apos;s a stone plaque of some sort, but it looks like it hasn&apos;t been touched in ages... Wiping off some of the sparkly dust, I can make out what it says:&lt;/p&gt;&lt;p&gt;&quot;Under starlight, a gentle breeze; a realm beyond what your mind can comprehend. To those who slipped through reality&apos;s seams: Welcome home.&quot;&lt;/p&gt;\n&lt;p&gt;What that implies, I&apos;m not sure. But I have a bad feeling in my stomach.&lt;/p&gt;\n&lt;p&gt;Deep breaths... It&apos;ll be okay, I think.&lt;/p&gt;\n&lt;p&gt;There&apos;s a wooden dock on the edge of the river here, too. Looking out between the cliffs the river carves through, I can see what I can only assume is a city, but it&apos;s clearly defying gravity... The buildings seem to be hanging upside-down.&lt;/p&gt;\n&lt;p&gt;But that does make me wonder, are there other people here? Like, people I can talk to? Or am I alone with the jellyfish for however long it takes for me to get out of here?&lt;/p&gt;\n&lt;p&gt;* * *&lt;/p&gt;&lt;p&gt;The trees are getting denser, and that nasty feeling in my chest is rising again. Believe me, I&apos;m trying to stay calm and think about this rationally, but I&apos;m not sure if logical thinking will help me in this situation. I&apos;m still not entirely sure if this is real, or one very vivid hallucination.&lt;/p&gt;\n&lt;p&gt;I am incredibly relieved to have had my baseball bat on me when I ended up here, though. I&apos;m nervous, sure, but I think I&apos;d be even more of a wreck if I didn&apos;t have any sort of self-defense. Because you never know when something  might...&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&quot;Sluuuuuuurp!&quot;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;I can feel my heart pumping absurdly fast now. Before I could even process the sound, a figure burst from the thick foliage! It&apos;s a grotesque creature reminicent of a mushroom, with a mouth filled with presumably hundreds of tiny jagged teeth. You know lampreys, those eel fish things with all those little teeth? It&apos;s like that, but on a huge, bulbous mushroom with a long sticky tongue.&lt;/p&gt;&lt;p&gt;And now, without warning, it&apos;s charging towards me! I&apos;m just barely able to react. I&apos;m scared stiff, but there&apos;s still enough adrenaline coursing through me to hold my bat in front of me like a knight guarding with a sword. The mushroom creature rams into it with a meaty &lt;em&gt;thump&lt;/em&gt;, and I&apos;m unharmed. I&apos;m on autopilot now--while it&apos;s recovering from the impact, I give it a big whack over the head. But it&apos;s not finished yet! It gets back up and begins to charge at me again, maw wide open, making disgusting slurping and slobbering sounds. I try to block it again, but it knows better this time. Instead of going straight towards me, it goes around and aims for my leg. And it bites down &lt;em&gt;hard&lt;/em&gt;. But at this point I couldn&apos;t care less about the pain, or at least that&apos;s what I&apos;m trying to tell myself. I haven&apos;t lost all hope just yet... The mushroom, as painful as it is, is very light. I shake it off my leg, and while it&apos;s in midair, I impulsively try to whack it across the forest clearing like a baseball...&lt;/p&gt; &lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;a href=&quot;https://gaehive.vercel.app/hivezine/post/43&quot;&gt;part 2 here!&lt;/a&gt;&lt;/p&gt;","id":44,"love":10,"loveby":["NebulaOfTheEarth","dancinqq-","lesbian-lucifer","ARCHlVED","holmes-aficionado","-arofluixity-","memorysauce","livid---liam","Moonwatcher127","LegoManiac04"],"yay":3,"yayby":["dancinqq-","dancinqq-","memorysauce"],"laugh":1,"laughby":["memorysauce"],"like":3,"likeby":["purple_cat_human_","--b-a-s-i-l--","memorysauce"],"wow":1,"wowby":["memorysauce"],"sad":1,"sadby":["lesbiandragons"]}]