[{"user":"MossIsQueer","uid":61852868,"date":"August 7, 2023","title":"History of Pride Flags 1 :pride: Lesbian","post":"The lesbian flag is one of the oldest pride flags we have. It&apos;s a very common identity with a lot of culture behind it, and that culture goes hand and hand with the flag, which has changed a lot over the past 25 years. Here&apos;s a timeline of the lesbian flag, then to now!&lt;br&gt;&lt;br&gt;&lt;center&gt;:pride:1999:pride:&lt;br&gt;&lt;br&gt; &lt;a href=&quot;https://imgbb.com/&quot;&gt;&lt;img src=&quot;https://i.ibb.co/GQ6pLFK/Screen-Shot-2023-08-07-at-11-54-12-AM.png&quot; alt=&quot;Screen-Shot-2023-08-07-at-11-54-12-AM&quot; border=&quot;0&quot;&gt;&lt;/a&gt;&lt;/center&gt;&lt;br&gt;&lt;br&gt;  The first recorded lesbian flag was made in 1999 by Sean Campbell, a gay artist. It looks completely different from the modern lesbian pride flags. Called the Labrys flag after the axe, it was centered around symbolism in shapes rather than color, most notably the black triangle that represents feminism and lesbianism. &lt;br&gt;&lt;br&gt;The Labrys Lesbian pride flag died a very quick death. Many lesbians were averse to the idea of using a pride flag that was made by a man. Additionally, the black triangle is a reclaimed symbol from Nazi Germany, who categorized certain people (including lesbians) with a black triangle. It was also adopted by TERF&apos;s and the anti-butch, so it was mostly deserted. In the early 2010s, a new, possibly more controversial flag surfaced.&lt;center&gt;&lt;br&gt;&lt;br&gt;:pride:2010:pride:&lt;br&gt;&lt;br&gt; &lt;a href=&quot;https://ibb.co/SJhJn1s&quot;&gt;&lt;img src=&quot;https://i.ibb.co/M9Y9Vj2/Screen-Shot-2023-08-07-at-11-54-35-AM.png&quot; alt=&quot;Screen-Shot-2023-08-07-at-11-54-35-AM&quot; border=&quot;0&quot;&gt;&lt;/a&gt; &lt;/center&gt; &lt;br&gt;&lt;br&gt;The lipstick lesbian pride flag is still sometimes used today. It was made by  Natalie McCray and was the main lesbian flag for about a decade. Known as the &quot;lipstick lesbian&quot; or &quot;pink lesbian&quot; flag, it was almost if not entirely exclusively representing &quot;femme&quot; lesbians, and ones who fit a very specific idea of lesbian femininity. This did not sit well with other lesbians, and for this reason, it stopped being the socially acceptable lesbian pride flag. &lt;br&gt;&lt;center&gt;&lt;br&gt;:pride:2018:pride:&lt;br&gt;&lt;br&gt;&lt;a href=&quot;https://imgbb.com/&quot;&gt;&lt;img src=&quot;https://i.ibb.co/hdwPwDN/Screen-Shot-2023-08-07-at-11-55-37-AM.png&quot; alt=&quot;Screen-Shot-2023-08-07-at-11-55-37-AM&quot; border=&quot;0&quot;&gt;&lt;/a&gt;\n&lt;br&gt;&lt;a href=&quot;https://imgbb.com/&quot;&gt;&lt;img src=&quot;https://i.ibb.co/9nKKT4m/Screen-Shot-2023-08-07-at-12-03-12-PM.png&quot; alt=&quot;Screen-Shot-2023-08-07-at-12-03-12-PM&quot; border=&quot;0&quot;&gt;&lt;/a&gt;&lt;/center&gt; A nonbinary lesbian named Emily Gwen created the sunset lesbian flag in 2018. It is, to this day, the most widely used lesbian flag. Each of its 7 colors has a meaning to the entire lesbian community, including colors representing gender nonconformity and a unique relationship to womanhood. You&apos;ll more commonly see the 5-color version of this flag, which is just a simplified version for easier use in design. They&apos;re both considered valid versions of the sunset lesbian flag.  &lt;br&gt;&lt;center&gt;&lt;br&gt;:pride:Ending Notes:pride:&lt;br&gt;&lt;/center&gt;&lt;br&gt;After almost 25 years, there is still no official lesbian flag. In addition to the mainstream flags discussed in this article, there are also a few other flags, including the sun lesbian and moon lesbian flags, ones made for specific use by nonbinary or trans lesbians, and others.  Queer flags are about as straightforward as the communities they represent (which is to say- they&apos;re not) so always make sure to ask questions about a flag before using it and be respectful to the rest of your community! (I may repost if the flags decide to be annoying and not work.)&lt;br&gt;&lt;br&gt;-Moss","id":52,"love":13,"loveby":["Anonymous_Triangle","furbiez-0-clock","Ruby_Crystals","ARandomNumberIs7482","livid---liam","evrymonthispridemont","K1TTYGVTS","chooz-eets","ARCHlVED","MossIsQueer","LegoManiac04","-Lotus-Eater-","melody-sy"],"like":10,"likeby":["Anonymous_Triangle","ARandomNumberIs7482","-Lotus-Eater-","coral4444","K1TTYGVTS","livid---liam","1kazul","MossIsQueer","nico_will70","melody-sy"],"wow":2,"wowby":["LegoManiac04","nico_will70"],"sad":1,"sadby":["lesbiandragons"]}]