[{"user":"MossIsQueer","uid":61852868,"date":"August 7, 2023","title":"Camp Gaehive  - Part 1","post":"Hi gaes! This is a lil series I&apos;m starting for Hivezine. It&apos;s like a Gaehive AU where the Hive is a camp, managers are counselors, and profiles are bunks.  If you feel uncomfortable with being featured in it or would like me to take out a line, please contact me on any of my projects or studio on Scratch. I will try to get around to putting every one in! [only if you want to be in it]! :frog: :cool: :happy: &lt;br&gt;&lt;br&gt;Part 1&lt;br&gt;&lt;br&gt;\n &quot;I suppose I should have anticipated that,&quot; I grumble. &lt;br&gt;&lt;br&gt;\n&quot;Yes, you should have,&quot; says Pearl, my cabinmate, pouring the remainder of the bucket of water that they just dumped on my head out the window. &quot;You didn&apos;t wake up at the bell, so I figured I&apos;d give you a nudge.&quot;&lt;br&gt;&lt;br&gt;&quot;Thanks for that,&quot; I reply, pushing myself out of bed. Camp Gaehive has everything a gae could ever wish for- but it&apos;s lacking in the sleep department. That might be at least partially my cabinmate&apos;s fault.  &lt;br&gt;&lt;br&gt;I brush through my short pink hair and tie it under an ace flag bandana. I assemble my backpack for the day as Pearl goes around to wake up the rest of our campsite. &lt;br&gt;&lt;br&gt; There are eight campsites in Camp Gaehive - one for each manager. Pearl and I are in Campsite 6, or Chaos, and it&apos;s under Brook.  &lt;br&gt;&lt;br&gt; I look at my watch, then turn to Pearl. &quot;It&apos;s 6:15, we have and hour and fifteen minutes until breakfast. I&apos;m going to teach you how to sail.&quot;&lt;br&gt;&lt;br&gt;&quot;To what?&quot;&lt;br&gt;&lt;br&gt;&quot;To sail. You know, like on a boat?&quot;&lt;br&gt;&lt;br&gt;&quot;Yeah, I know,&quot; Pearl replies. &quot;You know how to sail? And are there sailboats here?&quot;&lt;br&gt;&lt;br&gt;&quot;Camp Gaehive is purely hypothetical, so yes. With a progressive pride flag sail.  Because I said so.&quot;&lt;br&gt;&lt;br&gt;Only a true friend would get their best friend up in the morning, drag them all the way down to the hypothetical Lake Althive, rig a boat, and push the two of them out to sea in it with no warning.  &lt;br&gt;&lt;br&gt;So that, of course, is what I did. &lt;br&gt;&lt;br&gt; &quot;What&apos;s the point of this, exactly?&quot; Pearl asked, pulling garlic bread out of their overalls and taking a bite.&quot;&lt;br&gt;&lt;br&gt;&quot;I&apos;m going to teach &lt;i&gt;you&lt;/i&gt; how to sail,&quot; I replied, cleating a rope. &quot;Here, sit where I&apos;m sitting, and push on this rod. It&apos;s called the tiller.&quot;&lt;br&gt;&lt;br&gt;Confession time: I&apos;m a terrible teacher.&lt;br&gt;&lt;br&gt;Pearl pushed the stick towards himself. &quot;Wait, no!&quot; I yelled too late. &quot;That&apos;s a jibe! &quot;&lt;br&gt;&lt;br&gt;The hypothetical boat turned violently, and a riptide cut through the nonexistant lake. The boat keeled, leaving Pearl almost completely in the water.&lt;br&gt;&lt;br&gt;I looked down on them. &quot;Never, in your entire life, do what I&apos;m about to do,&quot; I advised. Then, I grabbed a rope in my teeth, unhooked another with my toes, extended my leg to grab Pearl, and tried to steer until we faced straight into the wind, our sail taking us nowhere.&lt;br&gt;&lt;br&gt; Did I mention I&apos;m a pessimist?&lt;br&gt;&lt;br&gt;So as I pulled Pearl up, of course my thoughts were &quot;What&apos;s the worst that can happen?&quot; followed by thinking about the worst that could happen.&lt;br&gt;&lt;br&gt;In a hypothetical world in which outcomes are based on the imagination, that is very dangerous.&lt;br&gt;&lt;br&gt;The boat turned rapidly towards the far shore of Lake Althive, which I&apos;d never seen, partially because, you know, it didn&apos;t really exist.  The boat pierced into the glittery rainbow shore, tipped over on land, and sent the two of us rolling down the rainbow, sticky, mud-covered hill.&lt;br&gt;&lt;br&gt;Pearl regained their footing first, and helped me up.   We both looked like we had been doused in liquid opals. It became clear that the clumpy, iridescant mud was not coming off. Pearl looked at their watch. &quot;We have fifteen minutes to get back to Chaos,&quot; they said.&lt;br&gt;&lt;br&gt;&lt;center&gt;&bull;&bull;&bull;&lt;/center&gt;&lt;br&gt;&lt;br&gt;When we got back to Chaos, everyone was already awake and waiting for us. &quot;No one saw them leave,&quot; Brook confirmed.  &lt;br&gt;&lt;br&gt; &quot;Nope,&quot; said Lucifer, not looking up from his Pjsekai game.&lt;br&gt;&lt;br&gt;Brook groaned. &quot;They&apos;re gonna make us late!&quot; they turned. &quot;Oh, hi guys!&quot;&lt;br&gt;&lt;br&gt;They glanced at our iridescent mud-covered figures. &lt;br&gt;&lt;br&gt;&quot;His fault,&quot; said Pearl, pointing at me. &lt;br&gt;&lt;br&gt;&quot;True,&quot; I said. &quot;I&apos;ll tell you all about it.&quot;&lt;br&gt;&lt;br&gt;&quot;Maybe take a shower first?&quot; Brook suggested.&lt;br&gt;&lt;br&gt;&quot;Deal.&quot;&lt;br&gt;&lt;br&gt;End. Hope you enjoyed! I didn&apos;t! I think this is the worst thing I&apos;ve ever written!","id":64,"frog":12,"frogby":["memorysauce","furbiez-0-clock","livid---liam","IatetocIass","--b-a-s-i-l--","Spacey_boy","Lavender_lillypad","ARandomNumberIs7482","Moonwatcher127","LegoManiac04","Amazing_Enby","MossIsQueer"],"sad":3,"sadby":["Spacey_boy","lesbiandragons","MossIsQueer"],"love":9,"loveby":["Prague_may23rd1618","furbiez-0-clock","-_MelonWater_-","Spacey_boy","melody-sy","LegoManiac04","ARCHlVED","Moonwatcher127","Amazing_Enby"],"like":4,"likeby":["furbiez-0-clock","Spacey_boy","coral4444","LegoManiac04"],"yay":2,"yayby":["furbiez-0-clock","Spacey_boy"],"wow":1,"wowby":["Spacey_boy"],"laugh":2,"laughby":["furbiez-0-clock","Spacey_boy"]}]